<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">

<html>
  <head>
    <meta name="generator" content="HTML Tidy, see www.w3.org">

    <title></title>
    <link href="file:///C|/Java%20Programs/puck/help/styles/helpstyles.css" rel="stylesheet" type="text/css">
    </head>

  <body>
    <table width="600" align="center">
      <tr>
        <td><h2>Seres Inertes </h2>

          <h4>Descripciones Extra </h4>
          <p>En la <a href="PrimerosPasos.html">secci&oacute;n anterior</a>, hemos visto algunos conceptos b&aacute;sicos de PUCK y hemos definido un mundo rudimentario con un par de habitaciones y caminos. Por el momento, lo &uacute;nico que este mundo permite hacer al jugador es desplazarse de una habitaci&oacute;n a otra a trav&eacute;s de los caminos; pero la interacci&oacute;n con el mundo no va mucho m&aacute;s all&aacute;. Por ejemplo: </p>
          <p>&nbsp;</p>
          <p class="transcript"><strong><em>&gt; mirar</em></strong><br>
  Te encuentras al este del gran r&iacute;o Pecos. Hay muchos &aacute;rboles bajos a tu alrededor. Un precario puente de madera lo atraviesa, hacia el oeste.<br>
  <em><strong>&gt; mirar los &aacute;rboles </strong></em><br>
          &iquest;Qu&eacute; pretendes mirar? <br>
          <strong><em>&gt; mirar el puente </em></strong><br>
          &iquest;Qu&eacute; pretendes mirar? </p>
          <p>&nbsp;</p>
          <p>Parece que una primera caracter&iacute;stica deseable para mejorar la interacci&oacute;n del jugador con el mundo ser&iacute;a que se pudiesen mirar los objetos que aparecen mencionados en las descripciones. As&iacute;, nos gustar&iacute;a que cuando el jugador pusiese &quot;mirar los &aacute;rboles&quot;, apareciese una descripci&oacute;n de los mismos para dar ambientaci&oacute;n. Esto se consigue en AGE mediante las llamadas descripciones adicionales o <em>descripciones extra</em>. Las descripciones extra pueden a&ntilde;adirse a casi cualquier objeto del mundo (incluyendo habitaciones, personajes, cosas, etc.) y siguen siempre el mismo sistema, que es una extensi&oacute;n del que segu&iacute;an las descripciones convencionales que hemos visto.</p>
          <p>As&iacute;, si en la secci&oacute;n anterior ve&iacute;amos que las descripciones convencionales eran realmente listas de descripciones, cada una de las cuales ten&iacute;a asociada una condici&oacute;n (que por el momento hab&iacute;amos dejado en blanco para que se mostraran siempre) y un texto; las descripciones extra tambi&eacute;n ser&aacute;n listas de descripciones; pero cada una tendr&aacute; asociada una serie de <em>nombres</em>, una condici&oacute;n y un texto. Si a&ntilde;adimos una descripci&oacute;n extra a una localidad y el jugador teclea &quot;mirar &lt;algo&gt;&quot; (o alguna frase sin&oacute;nima) en ella, entonces se mostrar&aacute; la descripci&oacute;n si ese &lt;algo&gt; coincide con uno de los nombres y adem&aacute;s la condici&oacute;n asociada se cumple.</p>
          <p>Vamos a hacer que el jugador pueda mirar los &aacute;rboles y el puente desde la localidad oeste. Para ello, hacemos click sobre esta localidad en el editor gr&aacute;fico, y nos aparece su panel de objetos. Debajo de la secci&oacute;n de descripciones convencionales que ya tenemos cubierta, vemos la secci&oacute;n &quot;Descripciones Extra&quot;. En el campo &quot;Nombres de ref. sep. por comas&quot; tecleamos, sin las comillas: &quot;&aacute;rbol,&aacute;rboles&quot;; y en el campo &quot;Descripci&oacute;n&quot; ponemos lo que queremos que le aparezca al jugador cuando mire los &aacute;rboles, como puede ser &quot;Son unos &aacute;rboles muy verdes y muy bonitos.&quot; Como en ocasiones anteriores, dejamos el campo &quot;Condici&oacute;n&quot; vac&iacute;o, ya que esta descripci&oacute;n no depender&aacute; de ninguna condici&oacute;n externa, y pulsamos el bot&oacute;n &quot;A&ntilde;adir&quot;. En la lista de descripciones extra veremos algo como &quot;&aacute;rbol,&aacute;rboles: Siempre: Son unos &aacute;rboles muy verdes y muy bonitos&quot;, donde se muestran los nombres y la descripci&oacute;n; y la palabra &quot;Siempre&quot; indica que la descripci&oacute;n va a mostrarse siempre que el jugador mire, sin depender de ning&uacute;n otro factor.</p>
          <p>Lo mismo podemos hacer con el puente si a&ntilde;adimos una descripci&oacute;n extra con nombre &quot;puente&quot; y descripci&oacute;n &quot;Es un precario puente de madera.&quot; o cualquier texto similar. Si queremos que el puente se vea desde las dos localidades, como ser&iacute;a l&oacute;gico, tenemos que poner su descripci&oacute;n extra en ambas.</p>
          <h4>&nbsp;</h4>
          <h4>Cosas</h4>
          <p>Las descripciones extra proporcionan una primera manera de hacer el mundo m&aacute;s interesante y llegar un poco m&aacute;s all&aacute; de las habitaciones y caminos; pero tienen sus limitaciones. Las descripciones extra nos permiten definir elementos del mundo que los jugadores pueden mirar; pero la posible interacci&oacute;n con ellos se reduce s&oacute;lo a eso: a mirar.</p>
          <p>A la hora de crear un juego decente, esto seguramente no sea suficiente. Nos interesan objetos f&iacute;sicos con los que los jugadores puedan interactuar de m&aacute;s maneras: cogerlos, llevarlos en su inventario, dejarlos en alguna otra parte, y seguramente hacer m&aacute;s cosas dependiendo del tipo de objeto que sea. Este tipo de objetos f&iacute;sicos son lo que en AGE denominamos &quot;cosas&quot;.</p>
          <p>Para probar las cosas, vamos a crear una piedra que el jugador pueda al menos coger, llevar y dejar. En cap&iacute;tulos posteriores del tutorial veremos c&oacute;mo hacer cosas m&aacute;s complejas (por ejemplo que puedan abrirse y cerrarse, llevar otras cosas dentro, etc.); pero por el momento empezaremos por lo b&aacute;sico. </p>
          <p>Al contrario que las descripciones extra, las cosas son objetos de pleno derecho en AGE, y tienen una representaci&oacute;n gr&aacute;fica en el editor del PUCK. Para a&ntilde;adir una cosa, utilizamos la herramienta &quot;a&ntilde;adir cosa&quot;:<br>
          <img src="../images/addItem.gif" width="48" height="48"> </p>
          <p>A la hora de utilizar esta herramienta, procedemos de manera an&aacute;loga a cuando hab&iacute;amos a&ntilde;adido un personaje al mundo: hacemos click sobre el icono de &quot;a&ntilde;adir cosa&quot;, movemos el cursor por el editor gr&aacute;fico hasta dejarlo en la ubicaci&oacute;n deseada para el objeto (que no debe coincidir con la habitaci&oacute;n en la que queremos ponerlo; aunque s&iacute; es conveniente que est&eacute; cerca), y hacemos click sobre esa ubicaci&oacute;n. </p>
          <p>Para colocar la cosa en una localidad, igual que hab&iacute;amos hecho con el personaje, creamos una relaci&oacute;n estructural: hacemos click en la herramienta &quot;crear relaci&oacute;n estructural&quot;<br>
          <img src="../images/addStruct.gif" width="48" height="48"> <br>
          y a continuaci&oacute;n en la habitaci&oacute;n y en la cosa, por ese orden. Esto crear&aacute; una relaci&oacute;n &quot;contiene&quot; entre habitaci&oacute;n y cosa que indica que la cosa est&aacute; situada en dicha habitaci&oacute;n.</p>
          <p>Una vez que tenemos nuestra cosa creada y vinculada a una habitaci&oacute;n, hacemos click en su icono del editor gr&aacute;fico para ver su panel de objeto. Los paneles de objeto de las cosas son algo m&aacute;s complicados que los de las habitaciones; pero algunos de sus componentes nos resultar&aacute;n familiares, y otros los aprenderemos f&aacute;cilmente.</p>
          <p>En primer lugar podemos ver el campo para el nombre &uacute;nico, que funciona igual que el de las habitaciones, sirviendo para distinguir internamente el objeto. En este punto es conveniente aclarar que los nombres &uacute;nicos deben ser realmente &uacute;nicos, es decir, no debe haber en un mundo dos objetos con el mismo nombre &uacute;nico, <em>ni siquiera</em> si son objetos de tipos completamente distintos. Esto quiere decir que no debes ponerle a una cosa un nombre que hayas utilizado para, por ejemplo, una habitaci&oacute;n. A nuestro objeto podemos llamarle &quot;Piedra&quot;. </p>
          <p>Bajo el nombre &uacute;nico, debajo de unos campos &quot;Heredar de:&quot; y &quot;Ejemplo de:&quot; que no veremos por el momento, podemos ver un campo de &quot;G&eacute;nero&quot;, que nos da a elegir entre masculino y femenino. El g&eacute;nero de una cosa es el g&eacute;nero que tiene en castellano el nombre de esa cosa, y se utiliza para construir  los textos del juego. Si pusi&eacute;semos que la piedra es &quot;Masculino&quot;, podr&iacute;amos obtener textos en el juego como &quot;aqu&iacute; hay un piedra&quot; o &quot;coges el piedra del suelo&quot;, as&iacute; que es importante cubrir bien este campo si queremos un mundo que hable decentemente el idioma.</p>
          <p>Debajo del g&eacute;nero, podemos ver unos campos para el &quot;Peso&quot; y el &quot;Volumen&quot; de la cosa que, como es imaginable, representan el peso y el volumen que tiene el objeto en el mundo virtual que estamos creando. Aunque se pueden utilizar para m&aacute;s cosas, la consecuencia m&aacute;s inmediata de estos valores es que un personaje no podr&aacute; llevar consigo objetos que superen el m&aacute;ximo peso y volumen que pueda acarrear. Si en tu juego no quieres prestar atenci&oacute;n a esos detalles, simplemente puedes dejar el peso y el volumen de todos los objetos a cero. En este caso podemos poner, por ejemplo, peso y volumen 5. </p>
          <p>A continuaci&oacute;n est&aacute;n las descripciones y las descripciones extra, que se rellenan de la misma manera que en las habitaciones. Las descripciones en este caso aparecer&aacute;n cuando un jugador ponga &quot;mirar &lt;nuestra cosa&gt;&quot;, y funcionar&aacute;n tanto si el jugador lleva consigo la cosa como si simplemente est&aacute; en la misma localidad. Las descripciones extra se pueden usar para describir partes o caracter&iacute;sticas de los objetos: por ejemplo, si nuestro objeto es una linterna, podemos usar una descripci&oacute;n extra para describir el bot&oacute;n de encendido de la linterna. Si ponemos como nombre para la descripci&oacute;n extra &quot;bot&oacute;n&quot;, y nuestra linterna respond&iacute;a al nombre &quot;linterna&quot;, el jugador podr&aacute; ver la descripci&oacute;n extra tecleando &quot;mirar el bot&oacute;n de la linterna&quot;. Nosotros nos limitaremos a a&ntilde;adir una descripci&oacute;n convencional para la piedra, algo como: &quot;Es una piedra est&aacute;ndar, de las de toda la vida. Podr&iacute;as abrir cabezas con ella.&quot; </p>
          <p>Todo esto est&aacute; en la ficha &quot;General&quot; del panel de objeto, que es la que hemos visto hasta ahora en todos los objetos que hemos creado. Sin embargo, puede que ya te hayas fijado en que algunos de ellos tienen m&aacute;s fichas aparte de &eacute;sta, y es el caso de nuestra reci&eacute;n creada piedra. Ahora vamos a ir a la segunda ficha, llamada &quot;Nombres&quot;. Cubrir esta ficha es esencial para crear una cosa, porque nos permite definir el nombre o nombres de dicha cosa.</p>
          <p>Hasta ahora, en la ficha &quot;General&quot; del panel hab&iacute;amos visto el &quot;Nombre &uacute;nico&quot; de la cosa, que nos serv&iacute;a para identificarla. Pero, como ya mencionamos al hablar de habitaciones, los nombres &uacute;nicos de los objetos s&oacute;lo se usan para que los distinga el creador del juego y el propio juego; sin que se muestren en ning&uacute;n caso al jugador. Por lo tanto, tendremos que definir otros nombres (que pueden coincidir o no con el nombre &uacute;nico) para mostrar al jugador y para que el jugador pueda interactuar con la piedra.</p>
          <p>En la ficha &quot;Nombres&quot; podemos ver espacio para poner cuatro tipos de nombres: &quot;Nombres singulares&quot;, &quot;Nombres plurales&quot;, &quot;Nombres singulares de referencia&quot; y &quot;Nombres plurales de referencia&quot;.</p>
          <p>Los dos primeros tipos son los nombres que se mostrar&aacute;n al jugador, y funcionan exactamente igual que las descripciones. Si queremos que el objeto se llame siempre de una manera determinada y ya est&aacute;, basta con que tecleemos su nombre en el campo &quot;Nombre:&quot; de &quot;Nombres singulares&quot; y pulsemos &quot;A&ntilde;adir&quot;. En nuestro caso, si a&ntilde;adimos de esta manera el nombre &quot;piedra&quot;, esto se traducir&aacute; en el juego a textos como &quot;aqu&iacute; puedes ver una piedra&quot;, &quot;coges la piedra&quot;, &quot;dejas la piedra&quot;, &quot;llevas una piedra&quot;... Si quisi&eacute;semos que el nombre de un objeto cambiase seg&uacute;n circunstancias del juego (por ejemplo, la piedra podr&iacute;a convertirse en una &quot;piedra mojada&quot; si le ech&aacute;semos agua por encima), tendr&iacute;amos que a&ntilde;adirle m&aacute;s nombres singulares y asociarles diferentes condiciones. Nosotros nos conformaremos con un nombre est&aacute;tico, as&iacute; que a&ntilde;adimos &quot;piedra&quot; sin especificar condici&oacute;n alguna.</p>
          <p>Los &quot;Nombres plurales&quot; se utilizan para mostrar al jugador si hay varios objetos iguales en un mismo sitio. Por ejemplo, para que el juego pudiese construir frases como &quot;llevas dos piedras&quot; o &quot;aqu&iacute; hay tres piedras&quot;, tendr&iacute;amos que a&ntilde;adir &quot;piedras&quot; como nombre plural. Si no va a haber varios objetos iguales en el juego que se puedan agrupar de esta manera, como es nuestro caso, podemos dejar los nombres plurales en blanco. M&aacute;s adelante veremos c&oacute;mo se pueden crear varios objetos id&eacute;nticos que se puedan agrupar, y utilizaremos estos nombres plurales.</p>
          <p>&nbsp; </p>
          <p>&nbsp;</p>
          <p>&nbsp;</p>
          <p>&lt;add + explain: canGet&gt;</p>
          <p>&lt;in advanced sections:&gt; </p>
          <p>&lt;openable+closable+lockable+unlockable+openable object panel&gt;</p>
          <p>&lt;wearable &amp; weapon types + type-dependent panel&gt; </p>
          <p>&nbsp;            </p>
        </td>
      </tr>
      <tr>
        <td>&nbsp;</td>
      </tr>
    </table>
  </body>
</html>

